{
  "backend/main.mo": "Empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Metadata describing a feature report referencing updates to frontend/index.html.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, dark mode overrides, and base styles.",
  "frontend/index.html": "HTML entry point setting document metadata and mounting the React app with title 'Aswin-Resume'.",
  "frontend/README.md": "Project README outlining features, image replacement instructions, and steps to add certificates.",
  "frontend/src/App.tsx": "Configures routes with TanStack Router and wraps the app in theme and identity providers.",
  "frontend/src/components/auth/AuthContext.tsx": "Auth context managing main user state and authentication via Internet Identity.",
  "frontend/src/components/certificates/CertificateGallery.tsx": "Renders a grid of certificate preview cards with PDF/image handling and scroll reveal animations.",
  "frontend/src/components/certificates/CertificateModal.tsx": "Modal displaying certificate details with PDF iframe or image rendering plus metadata.",
  "frontend/src/components/layout/SiteLayout.tsx": "Global layout with background texture, top navigation, routed content outlet, and footer links.",
  "frontend/src/components/media/ProfilePhotoCard.tsx": "Profile photo component showing uploaded image or fallback with decorative effects.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Wrapper animating children into view using IntersectionObserver and reduced-motion support.",
  "frontend/src/components/navigation/TopNav.tsx": "Responsive top navigation bar with links, authentication controls, and editing options for the main user.",
  "frontend/src/components/onboarding/modals/EditAboutContentModal.tsx": "Modal for editing About page text fields including titles, bio, and additional info.",
  "frontend/src/components/onboarding/modals/EditCertificateModal.tsx": "Modal for adding or editing certificate details and files with validation, save, and delete support.",
  "frontend/src/components/onboarding/modals/EditCertificatesListModal.tsx": "Modal listing certificates with preview thumbnails, allowing selection or creation of new certificates.",
  "frontend/src/components/onboarding/modals/EditCertificatesPageContentModal.tsx": "Modal for editing certificates page title and subtitle with simple form fields.",
  "frontend/src/components/onboarding/modals/EditContactContentModal.tsx": "Modal to edit contact page headings and call-to-action text fields.",
  "frontend/src/components/onboarding/modals/EditExperienceContentModal.tsx": "Modal for managing experience entries, including adding, editing, and removing jobs and achievements.",
  "frontend/src/components/onboarding/modals/EditHomeContentModal.tsx": "Modal to customize homepage hero text such as headline, tagline, and description.",
  "frontend/src/components/onboarding/modals/EditNameModal.tsx": "Simple modal to update and save the user's displayed name.",
  "frontend/src/components/onboarding/modals/EditPersonalDetailsModal.tsx": "Modal to edit personal details including name, bio, contact info, and location.",
  "frontend/src/components/onboarding/modals/EditProjectsModal.tsx": "A modal for adding, editing, and removing project entries, with local state and save/cancel handlers.",
  "frontend/src/components/onboarding/modals/EditProjectsPageContentModal.tsx": "A modal to edit the projects page title and subtitle, syncing state when opened.",
  "frontend/src/components/onboarding/modals/EditSiteTitleModal.tsx": "A modal for updating the site's navigation title with simple save and cancel behavior.",
  "frontend/src/components/onboarding/OnboardingGate.tsx": "Controls whether users see the welcome screen, onboarding workflow, or main site layout based on onboarding state and main-user status.",
  "frontend/src/components/onboarding/OnboardingScreen.tsx": "Main onboarding interface allowing users to upload profile data, manage certificates, and edit various site content sections through modals.",
  "frontend/src/components/onboarding/UploadsContext.tsx": "Context provider storing onboarding data and content, offering update, save, skip, and reopen functions with persistence.",
  "frontend/src/components/onboarding/uploadsStorage.ts": "Defines onboarding-related data interfaces and provides helpers for loading, saving, clearing, and normalizing onboarding data in localStorage.",
  "frontend/src/components/three/HeroScene.tsx": "A Three.js scene rendering a rotating distorted sphere with optional reduced motion support.",
  "frontend/src/components/three/SecondaryScene.tsx": "A Three.js scene showing animated floating boxes with reduced-motion handling.",
  "frontend/src/components/three/ThreeCanvasFrame.tsx": "A wrapper component that sets up a shared Canvas configuration for Three.js scenes.",
  "frontend/src/components/welcome/WelcomeScreen.tsx": "A welcome screen showing user info with options to edit their name or continue onboarding.",
  "frontend/src/data/certificates.ts": "Static sample certificate metadata used for display or testing.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication using AuthClient, handling login, stored identities, and status flags.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Returns whether the user prefers reduced motion by listening to a media query.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently empty.",
  "frontend/src/hooks/useSmoothScroll.ts": "Toggles smooth scrolling based on the user's reduced‑motion preference.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes along with motion‑reduction rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page with profile details, bio sections, skills, and animated reveal components using uploaded or default content.",
  "frontend/src/pages/CertificatesPage.tsx": "Displays a certificates gallery using uploaded or static certificates with a modal for viewing details.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information, CTA text, and social links sourced from uploads or fallbacks with animated sections.",
  "frontend/src/pages/ExperiencePage.tsx": "Presents a timeline of work experience using uploaded or default items with RevealOnScroll animations.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a 3D hero scene, dynamic text from uploads context, animated sections, and links to projects and contact. Also includes a features section showcasing services.",
  "frontend/src/pages/ProjectsPage.tsx": "Renders a projects listing page with optional custom projects, a 3D scene, animated reveal sections, and project cards with tags and links. Uses uploads context to override titles and project data.",
  "frontend/src/theme/tokens.ts": "Defines shared design tokens for motion timings/easing and spacing values for sections and containers.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended colors, fonts, shadows, radii, keyframes, and plugins, along with content paths and container settings.",
  "project_state.json": "Tracks project metadata, feature requests, and current state, including a request to update the browser tab title to 'Aswin-Resume'."
}