{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report stub containing an empty features array.",
  "frontend-file-summaries.txt": "Text file listing short summaries of various frontend source files.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/README.md": "Project README describing features, image replacement, and certificate-adding instructions.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with ThemeProvider and InternetIdentityProvider.",
  "frontend/src/components/auth/AuthContext.tsx": "Authentication context managing main user state using Internet Identity and localStorage.",
  "frontend/src/components/certificates/CertificateGallery.tsx": "Grid gallery showing certificate thumbnails or PDF placeholders with reveal animations.",
  "frontend/src/components/certificates/CertificateModal.tsx": "Modal displaying certificate details with image or embedded PDF viewer.",
  "frontend/src/components/layout/SiteLayout.tsx": "Global layout with background texture, navigation, content outlet, and footer with social links.",
  "frontend/src/components/media/ProfilePhotoCard.tsx": "Displays uploaded profile photo or fallback image with decorative effects.",
  "frontend/src/components/motion/RevealOnScroll.tsx": "Wrapper adding scroll-based reveal animations with reduced-motion support.",
  "frontend/src/components/navigation/TopNav.tsx": "Navigation bar component with links, user authentication actions, and edit options for the main user.",
  "frontend/src/components/onboarding/modals/EditAboutContentModal.tsx": "Modal for editing About page text fields including title, subtitle, bio, and additional info.",
  "frontend/src/components/onboarding/modals/EditCertificateModal.tsx": "Modal for adding or editing certificates with file upload, validation, and delete support.",
  "frontend/src/components/onboarding/modals/EditCertificatesListModal.tsx": "Displays a modal listing uploaded certificates, allowing selection for editing or adding a new certificate with previews for images or PDFs.",
  "frontend/src/components/onboarding/modals/EditCertificatesPageContentModal.tsx": "Modal for editing the certificates page title and subtitle with simple form inputs and save/cancel handling.",
  "frontend/src/components/onboarding/modals/EditContactContentModal.tsx": "Provides a modal to edit contact page headings and call‑to‑action text, syncing state with initial content on open.",
  "frontend/src/components/onboarding/modals/EditExperienceContentModal.tsx": "Manages a modal for adding, editing, and removing work experience entries and achievements in a dynamic list.",
  "frontend/src/components/onboarding/modals/EditHomeContentModal.tsx": "Modal for customizing homepage hero content including headline, tagline, and description.",
  "frontend/src/components/onboarding/modals/EditNameModal.tsx": "Simple modal to update the user's displayed name using the uploads context.",
  "frontend/src/components/onboarding/modals/EditPersonalDetailsModal.tsx": "Modal for editing full personal details such as name, headline, bio, contact info, and location with save/cancel behavior.",
  "frontend/src/components/onboarding/modals/EditProjectsModal.tsx": "Modal for creating, editing, and removing project entries, updating fields and saving filtered valid projects.",
  "frontend/src/components/onboarding/modals/EditProjectsPageContentModal.tsx": "Modal to edit the title and subtitle for the projects page with save and cancel handling.",
  "frontend/src/components/onboarding/modals/EditSiteTitleModal.tsx": "Modal that lets the user update the site's navigation title with reset and save actions.",
  "frontend/src/components/onboarding/OnboardingGate.tsx": "Controls onboarding and welcome flow, displaying onboarding screens or the main site layout based on user state.",
  "frontend/src/components/onboarding/OnboardingScreen.tsx": "Main onboarding interface allowing users to upload profile data, certificates, and edit multiple content sections using various modals.",
  "frontend/src/components/onboarding/UploadsContext.tsx": "Context provider managing all onboarding data, updates, persistence, and site title syncing.",
  "frontend/src/components/onboarding/uploadsStorage.ts": "Defines onboarding-related data interfaces and handles loading, saving, clearing, and converting files for localStorage.",
  "frontend/src/components/three/HeroScene.tsx": "Three.js scene rendering a rotating distorted sphere with optional reduced motion settings.",
  "frontend/src/components/three/SecondaryScene.tsx": "Three.js scene with animated floating boxes that rotate and oscillate unless reduced motion is preferred.",
  "frontend/src/components/three/ThreeCanvasFrame.tsx": "Wrapper component providing a configured Three.js Canvas for child 3D elements.",
  "frontend/src/components/welcome/WelcomeScreen.tsx": "Welcome screen showing the logged-in user's name with options to edit it or continue onboarding.",
  "frontend/src/data/certificates.ts": "Static list of sample certificate metadata with IDs, titles, issuers, dates, and images.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on user identity, updating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that tracks the user's prefers-reduced-motion setting via a media query.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file intended for future React Query hooks; exports nothing.",
  "frontend/src/hooks/useSmoothScroll.ts": "Hook that toggles smooth scrolling based on the user's reduced‑motion preference.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables, base styles, and reduced-motion overrides.",
  "frontend/src/main.tsx": "Application entry point that renders App wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page using uploaded content or defaults, including bio, skills, and visual components.",
  "frontend/src/pages/CertificatesPage.tsx": "Displays a certificates gallery using uploaded or static data with modal viewing support.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information and social links using uploaded data with animated sections.",
  "frontend/src/pages/ExperiencePage.tsx": "Renders a timeline-style work experience page using uploaded or default experience entries.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, animated text, CTA buttons, and a features section, using uploaded content when available.",
  "frontend/src/pages/ProjectsPage.tsx": "Displays a projects listing with optional custom project data, dynamic animations, and a 3D scene header.",
  "frontend/src/theme/tokens.ts": "Defines shared motion and spacing design tokens for durations, easing, and layout sizes.",
  "frontend/tailwind.config.js": "Configures Tailwind settings, theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Stores project metadata, feature requests, and architectural notes for an editable website with admin-only Internet Identity login."
}